function LS_code_tw() {
    var _self = this;
    var parentClass;
    var LangxAry;

    _self.init = function () {
        LangxAry = _self.set();
    }

    _self.set = function () {
        var ary = new Object();
        ary["0X000"] = "無此code碼";
        ary["0X001"] = "參數錯誤";
        ary["0X002"] = "系統錯誤";

        ary["4X001"] = "IP不合法";
        ary["4X002"] = "您的帳號已被停用，請聯繫您的上線開啟你的帳號.";
        ary["4X003"] = "您的帳號已被禁止登入，請聯繫您的上線開啟你的帳號！";
        ary["4X004"] = "您的帳戶已被鎖定，由於多次失敗的登入。請聯繫您的上線解封。";
        ary["4X005"] = "您輸入的帳號, 密碼或安全碼不正確，請再嘗試輸入。";
        ary["4X006"] = "三分鐘後再試";
        ary["4X007"] = "未設定email";
        ary["4X008"] = "無資料";
        ary["4X009"] = "含有特殊字元";
        ary["4X010"] = "登入帳號規則錯誤";
        //ary["4X011"] = "安全代碼規則錯誤";
        ary["4X011"] = "1. 安全代碼必須至少要有一個大寫，一個小寫英文字母和數字(0 - 9)組合, 字數最少8至16個。<br>2. 安全代碼必須三個不同的字母數字。<br>3. 安全代碼不允許有空格";
        ary["4X011_mem"] = "您的安全代碼必須根據以下規則:</br>1. 至少要有兩個大或小寫英文字母和數字(0 - 9)組合, 字數最少6至12個。</br>2. 三個不同的字母數字。</br>3. 不准許有空格。";
        ary["4X011_ag"] = "登入帳號必須由2個英文大小寫字母(A-Z和a-z)和數字(0-9)組合, 輸入限制6-12字元.";
        ary["4X012"] = "uid格式錯誤";
        ary["4X013"] = "首次登入";

        ary["4X014"] = "您已被強制登出。請重新登入。\n";
        ary["4X014"] += "您可能因以下其一原因被登出：\n";
        ary["4X014"] += "1.系統登出。\n";
        ary["4X014"] += "2.您的帳號在多個地方登錄。\n";
        ary["4X014"] += "請重新登入。如有任何疑問，請聯繫上線或客服中心。\n";

        //登3
        ary["4X015_ag"] = "您的登入帳號請勿和帳號或密碼相同。";
        //登1或登2
        ary["4X015"] = "您的安全代碼請勿和帳號或密碼相同。";
        ary["4X016"] = "您輸入的帳號已經有人使用了,請回上一頁重新輸入";
        ary["4X017"] = "已設置過安全代碼";
        ary["4X018"] = "原密碼錯誤";
        ary["4X019"] = "您的新密碼不能和現用密碼相同,請重新輸入。";
        ary["4X020"] = "密碼不匹配, 請重新輸入。";
        //ary["4X021"] = "密碼必須至少6個字元長，最多12個字元長，並只能有數字(0-9)，及英文大小寫字母";
        ary["4X021"] = "1. 密碼必須至少要有一個大寫, 一個小寫英文字母和數字(0 - 9)組合, 字數最少8至16個。</br>2. 密碼必須三個不同的字母數字。</br>3. 密碼不允許有空格。";
        // ary["4X021_mem"] = "您的密碼必須根據以下規則:</br>1. 至少要有兩個大或小寫英文字母和數字(0 - 9)組合, 字數最少6至12個。</br>2. 三個不同的字母數字。</br>3. 不准許有空格。";
        ary["4X021_mem"] = "1. 密碼必須至少要有兩個大或小寫英文字母和數字(0 - 9)組合, 字數最少6至12個。</br>2. 密碼必須三個不同的字母數字。</br>3. 密碼不允許有空格。";
        ary["4X022"] = "您的密碼請勿和帳號或登陸賬號相同。";
        ary["4X023"] = "您的密碼請勿和帳號或安全代碼相同。";
        ary["4X024"] = "您的密碼請勿和帳號相同。";
        //2019-10-25 密碼強度 新增語系
        ary["4X040"] = "密碼過於簡易會導致安全性的問題，請嘗試使用其他密碼組合。";
        ary["4X041"] = "安全代碼過於簡易會導致安全性的問題，請嘗試使用其他安全代碼組合。";

        ary["4X024"] = "該密碼您已使用過，為了安全起見，請使用新密碼.";
        ary["4X025"] = "此功能暫時已被禁用，請聯繫您的上線。";
        ary["4X026"] = "驗證碼發送次數過多，系統暫時不能接受申請，請檢查您的資料是否正確。";
        ary["4X027"] = "連不到MailServer";
        ary["4X028"] = "MailServer發送驗證碼失敗";
        ary["4X029"] = "您已超過此驗證碼的可嘗試次數,請重新獲取新的驗證碼。";
        ary["4X030"] = "您輸入的驗證碼不正確，請再嘗試輸入。";
        ary["4X031"] = "驗證碼不正確";
        ary["4X032"] = "mail enabled不為Y";
        ary["4X033"] = "您輸入的帳戶或登入帳號跟電子郵件不匹配, 請再嘗試輸入。";
        ary["4X034"] = "您已超過每天可獲取新驗證碼的次數,請聯絡您的上線為你解決密碼的問題。";
        ary["4O005"] = "驗證碼已發送到您的電子郵件";
        ary["4O006"] = "已成功註冊";

        return ary;
    }

    _self.get=function(_key){
        return LangxAry[_key]? LangxAry[_key] : _key;
    }

}