function LS_code_cn() {
    var _self = this;
    var parentClass;
    var LangxAry;

    _self.init = function () {
        LangxAry = _self.set();
    }

    _self.set = function () {
        var ary = new Object();
        ary["0X000"] = "无此code码";
        ary["0X001"] = "参数错误";
        ary["0X002"] = "系统错误";

        ary["4X001"] = "IP不合法";
        ary["4X002"] = "您的帐号已被停用，请联系您的上线开启你的帐号.";
        ary["4X003"] = "您的帐号已被禁止登入，请联系您的上线开启你的帐号！";
        ary["4X004"] = "您的帐户已被锁定，由于多次失败的登入。请联系您的上线解封。";
        ary["4X035"] = "您的帐户已到期，请联系您的上线开启你的帐号。";
        ary["4X005"] = "您输入的帐号, 密码或安全码不正确，请再尝试输入。";
        ary["4X006"] = "三分钟后再试";
        ary["4X007"] = "未设定email";
        ary["4X008"] = "无资料";
        ary["4X009"] = "含有特殊字元";
        ary["4X010"] = "登入帐号规则错误";
        //ary["4X011"] = "安全代码规则错误";
        ary["4X011"] = "您的安全代码必须根据以下规则:</br>1. 至少要有两个大或小写英文字母和数字(0 - 9)组合, 字数最少6至12个。</br>2. 三个不同的字母数字。</br>3. 不准许有空格。";
        ary["4X011_ag"] = "登入帐号必须由2个英文大小写字母(A-Z和a-z)和数字(0-9)组合, 输入限制6-12字元.";
        ary["4X012"] = "uid格式错误";
        ary["4X013"] = "首次登入";

        ary["4X014"] = "您已被强制登出。请重新登入。\n";
        ary["4X014"] += "您可能因以下其一原因被登出：\n";
        ary["4X014"] += "1.系统登出。\n";
        ary["4X014"] += "2.您的帐号在多个地方登录。\n";
        ary["4X014"] += "请重新登入。如有任何疑问，请联系上线或客服中心。\n";

        //登3
        ary["4X015_ag"] = "您的登入帐号请勿和帐号或密码相同。";
        //登1或登2
        ary["4X015"] = "您的安全代码请勿和帐号或密码相同。";
        ary["4X016"] = "您输入的帐号已经有人使用了,请回上一页重新输入";
        ary["4X017"] = "已设置过安全代码";
        ary["4X018"] = "原密码错误";
        ary["4X019"] = "您的新密码不能和现用密码相同,请重新輸入。";
        ary["4X020"] = "密码不匹配, 请重新输入。";
        //ary["4X021"] = "密码必须至少6个字元长，最多12个字元长，并只能有数字(0-9)，及英文大小写字母";
        ary["4X021"] = "您的密码必须根据以下规则:</br>1. 至少要有两个大或小写英文字母和数字(0 - 9)组合, 字数最少6至12个。</br>2. 三个不同的字母数字。</br>3. 不准许有空格。";
        ary["4X022"] = "您的密码请勿和帐号或登陆账号相同。";
        ary["4X023"] = "您的密码请勿和帐号或安全代码相同。";
        ary["4X024"] = "您的密码请勿和帐号相同。";
        ary["4X042"] = "验证码不正确, 请重新输入。";
        //2019-10-25 密碼強度 新增語系
        ary["4X040"] = "密码过于简易会导致安全性的问题，请尝试使用其他密码组合。";
        ary["4X041"] = "安全代码过于简易会导致安全性的问题，请尝试使用其他安全代码组合。";

        ary["4X024"] = "该密码您已使用过，为了安全起见，请使用新密码.";
        ary["4X025"] = "此功能暂时已被禁用，请联系您的上线。";
        ary["4X026"] = "验证码发送次数过多，系统暂时不能接受申请，请检查您的资料是否正确。";
        ary["4X027"] = "连不到MailServer";
        ary["4X028"] = "MailServer发送验证码失败";
        ary["4X029"] = "您已超过此验证码的可尝试次数,请重新获取新的验证码。";
        ary["4X030"] = "您输入的验证码不正确，请再尝试输入。";
        ary["4X031"] = "验证码不正确";
        ary["4X032"] = "mail enabled不为Y";
        ary["4X033"] = "您输入的帐户或登入帐号跟电子邮件不匹配, 请再尝试输入。";
        ary["4X034"] = "您已超过每天可获取新验证码的次数,请联络您的上线为你解决密码的问题。";
        ary["4O005"] = "验证码已发送到您的电子邮件";
        ary["4O006"] = "已成功注册";

        return ary;
    }

    _self.get=function(_key){
        return LangxAry[_key]? LangxAry[_key] : _key;
    }

}
